InformationRegisters/упДанныеТрекеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упДанныеТрекеров</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скорость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаправлениеДвижения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяДоСледующейТочки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеКоординаты</Name>
					<Comment>Представление широты и долготы в формате "34.451234;45.345666;"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Трекер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМобильныеУстройстваИТрекеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упДанныеДатчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упДанныеДатчиков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасшифровкаЗначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЗначенияДатчиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Трекер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМобильныеУстройстваИТрекеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Датчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДатчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упОбрабатываемыеСобытияМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упОбрабатываемыеСобытияМониторинга</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОтработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыОбработкиСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упВидыСобытийМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыСобытийМониторинга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВъездВЗону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыездИзЗоны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеДатчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененияЗначенияДатчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеОтМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеAndroidКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпозданиеВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланируемоеОпозданиеВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадержкаВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвижениеБезРейса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеВнешнейСистемыМониторинга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упСтатусыОбработкиСобытийМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыОбработкиСобытийМониторинга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТипыСобытийМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТипыСобытийМониторинга</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастотаОповещения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОстановки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Погрешность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Датчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДатчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыСравненияЗначенийДатчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеДатчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.упЗначенияДатчиков</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дельта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогрешностьВремя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыИзмененийЗначенийДатчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФиксироватьСобытиеВТочкеМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодИзменения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьПрохождениеТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦиклическиФиксироватьСобытиеМониторинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксироватьОтветВодителяПоСобытию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаВопросаИОтветов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНастройкиВопросаИОтветовПоСобытиямМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастраиваемоеСобытиеAndroidКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнициирующиеМониторингДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыДействийСобытийМониторинга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтменяющиеМониторингДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыДействийСобытийМониторинга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксирующиеСобытиеДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыДействийСобытийМониторинга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/упМониторинг/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполним удаление не актуальных данных спутникового мониторинга.
//
Процедура УдалениеНеактуальныхДанныхСпутниковогоМониторинга() Экспорт
	
	ПериодХраненияСпутниковыхДанных = упСервисныеФункции.ПолучитьЗначениеКонстанты("упПериодХраненияСпутниковыхДанных"); // в месяцах
	Если ПериодХраненияСпутниковыхДанных = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	АктуальнаяДата = ДобавитьМесяц(ТекущаяДатаСеанса(), -ПериодХраненияСпутниковыхДанных);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 200
	|	упДанныеТрекеров.Период,
	|	упДанныеТрекеров.ТранспортноеСредство
	|ИЗ
	|	РегистрСведений.упДанныеТрекеров КАК упДанныеТрекеров
	|ГДЕ
	|	упДанныеТрекеров.Период < &АктуальнаяДата";
	Запрос.УстановитьПараметр("АктуальнаяДата", АктуальнаяДата);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.упДанныеТрекеров.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
			НаборЗаписей.Отбор.ТранспортноеСредство.Установить(Выборка.ТранспортноеСредство);
			НаборЗаписей.Записать();
		КонецЦикла; 
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 200
	|	упДанныеДатчиков.Период,
	|	упДанныеДатчиков.ТранспортноеСредство,
	|	упДанныеДатчиков.Датчик
	|ИЗ
	|	РегистрСведений.упДанныеДатчиков КАК упДанныеДатчиков
	|ГДЕ
	|	упДанныеДатчиков.Период < &АктуальнаяДата";
	Запрос.УстановитьПараметр("АктуальнаяДата", АктуальнаяДата);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.упДанныеДатчиков.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
			НаборЗаписей.Отбор.ТранспортноеСредство.Установить(Выборка.ТранспортноеСредство);
			НаборЗаписей.Отбор.Датчик.Установить(Выборка.Датчик);
			НаборЗаписей.Записать();
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обрабатывает записи регистра "упОбрабатываемыеСобытияМониторинга".
//
Процедура ПоискПроизошедшихСобытий() Экспорт
	
	ИнформационнаяБазаФайловая = ?(ОбщегоНазначения.ИнформационнаяБазаФайловая()=0,ЛОЖЬ,ИСТИНА);
	
	КоличествоПотоков = упСервисныеФункции.ПолучитьЗначениеКонстанты("упКоличествоПотоковОбработкиСобытий");
	Если КоличествоПотоков = 0 ИЛИ ИнформационнаяБазаФайловая Тогда 
		КоличествоПотоков = 1;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упТипыСобытийМониторингаТранспортныеСредства.Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упТипыСобытийМониторингаТранспортныеСредства.ТранспортноеСредство) КАК КоличествоТС
	|ПОМЕСТИТЬ втТСтипСоб
	|ИЗ
	|	Справочник.упТипыСобытийМониторинга.ТранспортныеСредства КАК упТипыСобытийМониторингаТранспортныеСредства
	|ГДЕ
	|	упТипыСобытийМониторингаТранспортныеСредства.Ссылка.Активно
	|
	|СГРУППИРОВАТЬ ПО
	|	упТипыСобытийМониторингаТранспортныеСредства.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упТипыСобытийМониторинга.Ссылка,
	//|	упТипыСобытийМониторинга.ТранспортныеСредства.(
	//|		ТранспортноеСредство
	//|	),
	|	упТипыСобытийМониторинга.Зона,
	|	упТипыСобытийМониторинга.ВидСобытия,
	|	ЕСТЬNULL(втТСтипСоб.КоличествоТС, 0) КАК КоличествоТС,
	|	упТипыСобытийМониторинга.ЧастотаОповещения,
	|	упТипыСобытийМониторинга.ВремяОстановки,
	|	упТипыСобытийМониторинга.Погрешность,
	|	упТипыСобытийМониторинга.ПогрешностьВремя,
	|	упТипыСобытийМониторинга.Датчик,
	|	ВЫБОР
	|		КОГДА упТипыСобытийМониторинга.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.упВидыСобытийМониторинга.ЗначениеДатчика)
	|				ИЛИ упТипыСобытийМониторинга.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.упВидыСобытийМониторинга.ИзмененияЗначенияДатчика)
	|			ТОГДА упТипыСобытийМониторинга.Датчик.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упНазначенияДатчиков.ПустаяСсылка)
	|	КОНЕЦ КАК НазначениеДатчика,
	|	упТипыСобытийМониторинга.ВидСравнения,
	|	упТипыСобытийМониторинга.ЗначениеДатчика,
	|	упТипыСобытийМониторинга.Дельта,
	|	упТипыСобытийМониторинга.ТипИзменения,
	|	упТипыСобытийМониторинга.ПериодИзменения,
	|	упТипыСобытийМониторинга.Расстояние,
	|	упДельтаОтклоненияОтТочкиМаршрута.Значение КАК ДельтаОтклоненияОтТочкиМаршрутаМетры,
	|	упТипыСобытийМониторинга.НеФиксироватьСобытиеВТочкеМаршрута,
	|	упТипыСобытийМониторинга.СоздаватьПрохождениеТочки,
	|	упШиротаДляРасчетаКоличестваМетровВГрадусе.Значение КАК ШиротаДляРасчета
	|ИЗ
	|	Справочник.упТипыСобытийМониторинга КАК упТипыСобытийМониторинга
	|		ПОЛНОЕ СОЕДИНЕНИЕ Константа.упДельтаОтклоненияОтТочкиМаршрута КАК упДельтаОтклоненияОтТочкиМаршрута
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ Константа.упШиротаДляРасчетаКоличестваМетровВГрадусе КАК упШиротаДляРасчетаКоличестваМетровВГрадусе
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТСтипСоб КАК втТСтипСоб
	|		ПО упТипыСобытийМониторинга.Ссылка = втТСтипСоб.Ссылка
	|ГДЕ
	|	упТипыСобытийМониторинга.Активно
	|	И ВЫБОР
	|			КОГДА упТипыСобытийМониторинга.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.упВидыСобытийМониторинга.ЗначениеДатчика)
	|					ИЛИ упТипыСобытийМониторинга.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.упВидыСобытийМониторинга.ИзмененияЗначенияДатчика)
	|				ТОГДА упТипыСобытийМониторинга.Датчик <> ЗНАЧЕНИЕ(Справочник.упДатчики.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И (&ИспользуетсяАндроидКлиент
	|			ИЛИ упТипыСобытийМониторинга.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.упВидыСобытийМониторинга.СобытиеAndroidКлиента))
	|
	|УПОРЯДОЧИТЬ ПО
	|	упТипыСобытийМониторинга.ВидСобытия.Порядок";
	Запрос.УстановитьПараметр("ИспользуетсяАндроидКлиент", ПолучитьФункциональнуюОпцию("упИспользуетсяАндроидКлиент"));
	текРезультат = Запрос.Выполнить();
	
	текДата = ТекущаяДатаСеанса();
	ПустаяДата = Дата("00010101000000");
	
	мсвПотоков = Новый Массив(КоличествоПотоков);
	
	тбзТипыСобытий = Новый ТаблицаЗначений;
	тбзТипыСобытий.Колонки.Добавить("Ссылка");
	тбзТипыСобытий.Колонки.Добавить("ВидСобытия");
	тбзТипыСобытий.Колонки.Добавить("Зона");
	тбзТипыСобытий.Колонки.Добавить("КоличествоТС");
	
	тбзТипыСобытий.Колонки.Добавить("ЧастотаОповещения");
	//тбзТипыСобытий.Колонки.Добавить("ТранспортныеСредства");
	тбзТипыСобытий.Колонки.Добавить("ВремяОстановки");
	тбзТипыСобытий.Колонки.Добавить("Погрешность");
	тбзТипыСобытий.Колонки.Добавить("ПогрешностьВремя");
	
	тбзТипыСобытий.Колонки.Добавить("Датчик");
	тбзТипыСобытий.Колонки.Добавить("НазначениеДатчика");
	тбзТипыСобытий.Колонки.Добавить("ВидСравнения");
	тбзТипыСобытий.Колонки.Добавить("ЗначениеДатчика");
	
	тбзТипыСобытий.Колонки.Добавить("Дельта");
	тбзТипыСобытий.Колонки.Добавить("ТипИзменения");
	тбзТипыСобытий.Колонки.Добавить("ПериодИзменения");
	
	тбзТипыСобытий.Колонки.Добавить("Расстояние");		
	
	тбзТипыСобытий.Колонки.Добавить("ДельтаОтклоненияОтТочкиМаршрутаМетры");
	тбзТипыСобытий.Колонки.Добавить("НеФиксироватьСобытиеВТочкеМаршрута");
	тбзТипыСобытий.Колонки.Добавить("СоздаватьПрохождениеТочки");	
	тбзТипыСобытий.Колонки.Добавить("ШиротаДляРасчета");
	
	Если КоличествоПотоков = 1 Тогда
		мсвПотоков[0] = тбзТипыСобытий;
	Иначе
		КрайнийИндекс = мсвПотоков.ВГраница();
		Для Индекс = 0 по КрайнийИндекс Цикл
			мсвПотоков[Индекс] = тбзТипыСобытий.Скопировать();
		КонецЦикла;
	КонецЕсли;
	
	текВыборка = текРезультат.Выбрать();
	
	Сч = 0;
	
	Пока текВыборка.Следующий() Цикл 
		
		Попытка
			НачатьТранзакцию();
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.упОбрабатываемыеСобытияМониторинга");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("ТипСобытия", текВыборка.Ссылка);
			
			Блокировка.Заблокировать();
			
			текЗапись = РегистрыСведений.упОбрабатываемыеСобытияМониторинга.СоздатьМенеджерЗаписи();
			текЗапись.ТипСобытия = текВыборка.Ссылка;
			текЗапись.Прочитать();
			
			Если текЗапись.Выбран() Тогда
				Если текЗапись.СтатусОтработки = Перечисления.упСтатусыОбработкиСобытийМониторинга.Обрабатывается Тогда 
					ОтменитьТранзакцию();
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			текЗапись.ТипСобытия		  = текВыборка.Ссылка;
			текЗапись.ДатаНачалаОбработки = текДата;
			текЗапись.СтатусОтработки	  = Перечисления.упСтатусыОбработкиСобытийМониторинга.Обрабатывается;
			текЗапись.ДатаОтработки		  = ПустаяДата;
			текЗапись.Записать();
			
			НовоеСобытие = мсвПотоков[Сч].Добавить();
			ЗаполнитьЗначенияСвойств(НовоеСобытие, текВыборка);
			
			Сч = Сч + 1;
			Если Сч = КоличествоПотоков Тогда 
				Сч = 0;
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			Если ТранзакцияАктивна() Тогда 
				ОтменитьТранзакцию();
			КонецЕсли;
			// Ничего страшного - обработаем в следующий раз.
		КонецПопытки;
		
	КонецЦикла;	
	
	Если ИнформационнаяБазаФайловая Тогда
		Если мсвПотоков.Количество() Тогда
			СоздатьПотокОбработкиМониторингаСобытий(мсвПотоков[0]);
		КонецЕсли;
	Иначе
		Для Каждого текЭлемент Из мсвПотоков Цикл
			Если текЭлемент.Количество() Тогда 
				мсвПараметров = Новый Массив(1);
				мсвПараметров[0] = текЭлемент;
				упУправлениеФоновымиЗадачами.ВыполнитьФоновоеЗадание("упМониторинг.СоздатьПотокОбработкиМониторингаСобытий", мсвПараметров,,,"ПоискПроизошедшихСобытийМониторинга");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//СоздатьПотокОбработкиМониторингаСобытий(мсвПотоков[0]);
	
КонецПроцедуры // ПоискПроизошедшихСобытий()

// Выполним создание разных потоков обработки.
//
// Параметры:
//  тбзТипыСобытий - ТаблицЗаначений - Таблица с данными для обработки.
//
Процедура СоздатьПотокОбработкиМониторингаСобытий(тбзТипыСобытий) Экспорт
	
	Сеанс = НомерСеансаИнформационнойБазы();
	Дата  = ТекущаяДатаСеанса();
	Для Каждого текТипСобытия Из тбзТипыСобытий Цикл 
		текЗапись = РегистрыСведений.упОбрабатываемыеСобытияМониторинга.СоздатьМенеджерЗаписи();
		текЗапись.ТипСобытия = текТипСобытия.Ссылка;
		текЗапись.Прочитать();          
		Если текЗапись.Выбран() Тогда
			текЗапись.ТипСобытия		  = текТипСобытия.Ссылка;
			текЗапись.СтатусОтработки	  = Перечисления.упСтатусыОбработкиСобытийМониторинга.Обрабатывается;
			текЗапись.НомерСеанса		  = Сеанс;
			текЗапись.ДатаНачалаОбработки = Дата;
			текЗапись.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого текТипСобытия Из тбзТипыСобытий Цикл 
		ОбработатьТипыСобытий(текТипСобытия);
	КонецЦикла;
	
КонецПроцедуры

// Выполним обработку каждого типа события.
//
// Параметры:
//  ВыборкаТипыСобытий  - Выборка запроса - Выборка.
//
Процедура ОбработатьТипыСобытий(ВыборкаТипыСобытий)		
	
	упСЛК.СоздатьОбъект().ОбработатьТипыСобытий(ВыборкаТипыСобытий);
	
КонецПроцедуры

#Область ВычислитьРасстояниеПоДанным

// Выполнить подсчет расстояния по данным трекера ТС за укзанный период.
//
// Параметры:
//  НачалоПериода  - Дата - Начало периода вычисления.
//  ОкончаниеПериода  - Дата - Окончание периода вычисления.
//  ТранспортноеСредство  - СправочникСсылка.упТранспортныеСредства - Ссылка на ТС для которового проводим вычисление.
//
// Возвращаемое значение:
//   Число - Значение в метрах пройденного расстояния.
//
Функция упВычислитьРасстояниеПоДаннымТрекеров(НачалоПериода, ОкончаниеПериода, ТранспортноеСредство)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ (ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(ОкончаниеПериода) И ЗначениеЗаполнено(ТранспортноеСредство)) Тогда
		Возврат 0;
	КонецЕсли;
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упДанныеТрекеров.Период КАК Период,
	|	упДанныеТрекеров.Широта,
	|	упДанныеТрекеров.Долгота
	|ИЗ
	|	РегистрСведений.упДанныеТрекеров КАК упДанныеТрекеров
	|ГДЕ
	|	упДанныеТрекеров.ТранспортноеСредство = &ТС
	|	И упДанныеТрекеров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("КонецПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ТС", ТранспортноеСредство);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредыдущаяТочка = Неопределено;
	Пока Выборка.Следующий() Цикл
		Если НЕ ПредыдущаяТочка = Неопределено Тогда
			ТекущаяДлинна = упРаботаСКартамиКлиентСервер.ПолучитьРасстояниеМеждуТочками(ПредыдущаяТочка.Широта,ПредыдущаяТочка.Долгота,Выборка.Широта,Выборка.Долгота);
			Попытка
				Результат = Результат + ТекущаяДлинна;
			Исключение
				// Продолжим вычисление.
			КонецПопытки;
		КонецЕсли;
		ПредыдущаяТочка = Новый Структура("Широта,Долгота",0,0);
		ЗаполнитьЗначенияСвойств(ПредыдущаяТочка,Выборка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // упВычислитьРасстояниеПоДаннымТрекеров()

// Выполнить подсчет расстояния по данным датчиков ТС за укзанный период.
//
// Параметры:
//  НачалоПериода  - Дата - Начало периода вычисления.
//  ОкончаниеПериода  - Дата - Окончание периода вычисления.
//  ТранспортноеСредство  - СправочникСсылка.упТранспортныеСредства - Ссылка на ТС для которового проводим вычисление.
//
// Возвращаемое значение:
//   Число - Значение в метрах пройденного расстояния.
//
Функция упВычислитьРасстояниеПоДаннымДатчиков(НачалоПериода, ОкончаниеПериода, ТранспортноеСредство)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ (ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(ОкончаниеПериода) И ЗначениеЗаполнено(ТранспортноеСредство)) Тогда
		Возврат 0;
	КонецЕсли;
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упДатчики.Ссылка
	|ПОМЕСТИТЬ вт_Датчики
	|ИЗ
	|	Справочник.упДатчики КАК упДатчики
	|ГДЕ
	|	упДатчики.Назначение = ЗНАЧЕНИЕ(Справочник.упНазначенияДатчиков.Одометр)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Датчики.Ссылка,
	|	упДанныеДатчиковСрезПервых.Период КАК ПериодН,
	|	упДанныеДатчиковСрезПоследних.Период КАК ПериодК,
	|	упДанныеДатчиковСрезПервых.Значение КАК ЗначениеН,
	|	упДанныеДатчиковСрезПоследних.Значение КАК ЗначениеК,
	|	ВЫБОР
	|		КОГДА упДанныеДатчиковСрезПоследних.Значение ЕСТЬ NULL
	|				ИЛИ упДанныеДатчиковСрезПервых.Значение ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ упДанныеДатчиковСрезПоследних.Значение - упДанныеДатчиковСрезПервых.Значение
	|	КОНЕЦ КАК Разность
	|ПОМЕСТИТЬ вт_Данные
	|ИЗ
	|	вт_Датчики КАК вт_Датчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упДанныеДатчиков.СрезПервых(&НачалоПериода, ТранспортноеСредство = &ТС) КАК упДанныеДатчиковСрезПервых
	|		ПО вт_Датчики.Ссылка = упДанныеДатчиковСрезПервых.Датчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упДанныеДатчиков.СрезПоследних(&КонецПериода, ТранспортноеСредство = &ТС) КАК упДанныеДатчиковСрезПоследних
	|		ПО вт_Датчики.Ссылка = упДанныеДатчиковСрезПоследних.Датчик
	|ГДЕ
	|	ВЫБОР
	|			КОГДА упДанныеДатчиковСрезПервых.ТранспортноеСредство ЕСТЬ NULL
	|					И упДанныеДатчиковСрезПоследних.ТранспортноеСредство ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Данные.Ссылка КАК Датчик,
	|	МАКСИМУМ(вт_Данные.Разность) КАК Разность
	|ИЗ
	|	вт_Данные КАК вт_Данные
	|ГДЕ
	|	ВЫБОР
	|			КОГДА вт_Данные.Разность > 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_Данные.Ссылка";
	
	Запрос.УстановитьПараметр("КонецПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ТС", ТранспортноеСредство);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Разность;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // упВычислитьРасстояниеПоДаннымДатчиков()


#КонецОбласти

#КонецОбласти
